{
  "scenes": {
    "start": {
      "welcome_back": "С возвращением! Теперь ты снова можешь следить за релизами своих любимых фильмов! Чем я могу помочь тебе?",
      "new_account": "Аккаунт создан успешно! Перед началом работы, рекомендую тебе прочитать небольшую инструкцию о том, кто я такая и как со мной работать 😊",
      "bot_description": "<b>🔻 Сейчас я работаю в режиме открытого бета-теста и разработка все еще в процессе. Во время использования у тебя могут быть ошибки, не стесняйся обращаться к Создателю из секции ✍️ Контакт\n\n</b>🔻 Меня зовут Eve, я помогу тебе отслеживать появление новых фильмов на торренте. С помощью поиска найди интересующий тебя фильм и добавь его в свою коллекцию, а я напишу тебе, когда ты сможешь его скачать и посмотреть в хорошем качестве\n\n🔻 На данный момент я умею искать только фильмы, но скоро я научусь искать сериалы, а также делать много других интересных вещей\n\n🔻 Ты можешь давать мне команды с помощью Telegram-клавиатуры. Чтобы открыть ее, нажми на иконку в правом нижнем углу\n\n🔻 Если что-то сломалось, напиши мне /saveme и я попытаюсь все починить\n\n🔻 Больше информации про меня ты сможешь найти в секции❓ Обо мне\n\n🔻 Надеюсь, что тебе понравится!\n\nP.S. А еще у меня теперь открытый исходный код! Можешь проверить его здесь: https://github.com/dmbaranov/evemovies-bot",
      "lets_go": "Погнали!"
    },
    "about": {
      "main": "Привет! Прежде всего, позволь сказать спасибо за то, что установил меня!\n\nУ тебя когда-нибудь бывало такое, что ты приходишь в кино и видишь трейлер фильма, который хочется скачать и посмотреть, когда он выйдет? Но проходит время, ты про него забываешь и в лучшем случае возвращаешься к нему через несколько месяцев.. Или не возвращаешься вообще :(\n\nУ моего автора была такая проблема и поэтому он придумал меня! Меня зовут Eve и я помогаю ему отслеживать любые фильмы, которые он хочет - как только они появляются на торрентах, я отправляю ему уведомление и теперь он не забывает про них! Если хочешь, я и тебе могу с этим помочь! Для этого перейди в меню поиска и вбей названия фильмов, а я напишу тебе, когда ты сможешь их скачать! Если хочешь посмотреть на мой исходный код, он доступен здесь: https://github.com/dmbaranov/evemovies-bot"
    },
    "movies": {
      "chosen_movie": "Выбранный фильм: ${title}",
      "list_of_movies": "Вот список твоих фильмов",
      "back_button": "◀️ Назад",
      "delete_button": "❌ Удалить",
      "delete_unwanted_movies": "Ты можешь удалить фильмы, которые тебе больше не интересны",
      "no_movies_in_collection": "🗑 В твоей коллекции пока нет фильмов. Нужно срочно добавить несколько!"
    },
    "timetable": {
      "timetable_select": "Поделитесь, когда вы обычно свободны на выходных?",
      "week6" : "субботу",
      "week7": "воскресенье",
      "keyboard": {
        "night" : "Ночь",
        "week6" : "✅ Суббота (12:00-18:00)",
        "week7": "[ ] Воскресенье (не выбрано)",
        "disabled": "Отключено",
        "weekend": "Выходной"
      }
    },
    "time_interval": {
      "interval_select": "В какое время вам удобно будет в ${weekday}",
      "keyboard": {
        "all_day" : "Весь день",
        "all_day_selected" : "✅ Весь день",
        "slot": "c ${from} до ${to}",
        "slot_selected": "✅ с ${from} до ${to}"
      }
    },
    "list": {
      "welcome_to_list": "☝ Вот что есть интересненького",
      "chosen_movie": "Выбранный фильм: ${title}",
      "added_movie_to_lib": "✅ Я добавила ${title} в твою библиотеку и напишу тебе, когда он выйдет в хорошем качестве! Можешь продолжить поиск или вернуться в главное меню",
      "list_of_found_movies": "🔎 Вот список фильмов, которые я нашла для тебя. Выбирай любой или уточни название фильма",
      "continue_search": "${canAddResult} Можешь продолжить поиск или вернуться в главное меню",
      "back_button": "◀️ Назад",
      "add_button": "➕ Добавить",
      "reason_movie_released": "🔔 Этот фильм уже доступен на торрентах.",
      "reason_already_observing": "🚫 Этот фильм уже есть в твоей библиотеке.",
      "nothing_found_in_interval": "🗑 Нету событий с ${from} до ${to}",
      "nothing_found": "🗑 Я ничего не нашла по этому запросу... /saveme"
    },
    "customize": {
      "keyboard": {
        "timetable": "🕒 Время",
        "oblasti": "🔣 Области",
        "cennosti": "💟 Ценности"
      }
    }
  },
  "shared": {
    "what_next": "✋ Привет! Я помогу вам подобрать мероприятие на ближайшие выходные\n\nПока я только учусь, и умею выводить только 5 лучших событий с каждой категории, которую ты выберешь. Попробуй команду /saveme",
    "something_went_wrong": "❌ Ошибочка вышла.. Попробуй еще раз",
    "something_went_wrong_dev": "❌ Ошибочка вышла.. Передайте, пожалуйста, моему разработчику: ${error}",
    "back": "◀️ Назад"
  },
  "sync": {
    "wrong_format": "❌ Ошибочка вышла. Девочки, я заметила что эксель поменялся. \n\nНа листе <b>${listName}</b> в ячейке <b>${columnName}</b> я ожидала колонку \"${expected}\", но сейчас там \"${actual}\"",
    "sync_success": "✅ База обновлена. \n\n<b>Загружено:</b> ${updated}\n<b>Ошибки:</b> ${errors}\n\nЯ отметила ошибки красненьким в файлике."
  },
  "keyboards": {
    "back_keyboard": {
      "back": "◀️ Назад"
    },
    "main_keyboard": {
      "theaters": "🎭 Театры",
      "exhibitions": "👀 Выставки",
      "movies": "🎥 Кино",
      "events": "💡️ Мероприятия",
      "walks": "🏃Прогулки",
      "concerts": "🎼 Концерты",
      "customize": "⭐ Подобрать под мои интересы"
    },
    "timetable_keyboard": {
      "saturday" : "Суббота:",
      "sunday": "Воскресенье:",
      "slot": "${from}-${to}",
      "slot_selected": "✅ ${from}-${to}",
      "back": "◀️ Назад"
    }
  },
  "other": {
    "movie_has_been_released": "🎉 Фильм ${movie} вышел и доступен на торрентах!",
    "default_handler": "🚧 Нажми на иконку в правом нижнем углу чтобы открыть Telegram-клавиатуру и выбери раздел, в который ты хочешь попасть",
    "support": "🤝 Если тебе все нравится и ты хочешь выразить благодарность мне и Создателю, то ты можешь сделать это несколькими способами:"
  }
}
