import React from 'react'
import styles from './terms.module.scss'

export default function Terms(): JSX.Element {
    return (
        <div className={styles.container}>
            <h3>Предупреждение</h3>Вся информация на сайте invest-idei.ru (далее - Сайт)
            носит исключительно образовательный и научный характер и не является рекомендацией или предложением
            к
            совершению сделок с финансовыми инструментами. Вы можете следовать или не следовать прогнозам на
            свой
            страх и риск. Компании и аналитики, прогнозы которых размещены на сайте invest-idei.ru, являются
            независимыми от создателей сайта лицами. Сайт invest-idei.ru является агрегатором информации,
            размещенной указанными лицами на интернет-ресурсах и в прочих источниках, а также публичных данных о
            сделках с ценными бумагами или другими финансовыми инструментами. Клиенты брокеров могут получать по
            подписке иные рекомендации, а также раньше или позже того, как они были опубликованы на
            Сайте.<br/><br/>Сайт
            invest-idei.ru не берет на себя обязательство корректировать аналитические данные и инвестиционные
            идеи в связи с утратой актуальности содержащейся в них информации, а также при выявлении
            несоответствия приводимых данных действительности. <br/><br/>Администрация invest-idei.ru не несет
            ответственности за содержание и последствия использования размещенной информации, в том числе за
            любые возможные убытки от сделок с финансовыми инструментами. <br/><br/>
            Сайт invest-idei.ru не участвует во взаимоотношениях пользователей сайта и инвестиционных
            компаний и аналитиков, предоставляя только сервис публикации и отслеживания инвестиционных
            идей.<br/><br/> <b>Если Вы не согласны с данными условиями, немедленно покиньте Сайт и не
            используйте размещенную на нем информацию.</b><br/><br/><h3>Реквизиты магазина:</h3>ООО
            &quot;Экспертное мнение&quot;<br/>
            ИНН: 7802597320<br/>
            КПП: 780201001<br/>
            ОГРН: 1167847405351<br/><br/>Контактный адрес электронной
            почты: <b>support@invest-idei.ru</b><br/><br/><h2>Публичная оферта</h2><h3>Общие
            положения</h3>
            Данный документ является официальным публичным предложением для конкретных лиц, а
            именно исключительно для физических лиц.
            <br/><br/>
            Ответ лица о принятии настоящей оферты (далее «Акцепт») равносилен заключению
            Договора о
            предоставлении Заказчику услуги доступа к сервису «Инвест-идеи» (далее «Сервис»)
            на сайте https://invest-idei.ru (далее «Сайт») и c помощью других каналов связи.
            <br/><br/>
            Под доступом к Сервису здесь и далее понимается доступ к функциям поиска по
            базе данных на Сайте, Телеграм-Сервису &quot;Бот Инвест-Идей&quot;, сервису &quot;Портфель&quot;
            и конкурсу &quot;Лига Инвест-Идей&quot; (Статус PRO). Доступ к Сервису осуществляется
            под личными логином и паролем Заказчика.
            <br/><br/>
            Полным и безоговорочным Акцептом настоящей оферты является осуществление
            Заказчиком предоплаты предлагаемых услуг за выбранный период времени
            путем перечисления денежных средств Исполнителю.
            <br/><br/><h3>1. Предмет и стоимость договора</h3><br/>
            1.1. Исполнитель обязуется оказать услуги Заказчику, а Заказчик
            принять и оплатить данные Услуги. Под Услугами понимается доступ к
            Сервису.<br/><br/> <b>1.2. Период оказания Услуг
            составляет:</b><br/><br/>
            1.2.1. Услуги оказываются в течение календарного периода, выбранного
            Заказчиком в специальной форме заявки на Сайте. Датой начала
            оказания услуг является дата оплаты через платежную систему.<br/>
            1.2.2. Минимальный период оказания услуг составляет 3 (три)
            месяца.<br/>
            1.2.3. По окончании указанного Заказчиком срока Периода оказания
            услуг, если ни одна из Сторон не заявит о желании расторгнуть
            Договор до даты окончания действующего периода, Договор считается
            пролонгированным на следующий аналогичный календарный период.
            Количество пролонгаций не ограничено.<br/><br/> <b>1.3. Стоимость
            услуг:</b><br/><br/>
            1.3.1. За 3 календарных месяца составляет 1497 рублей 00 копеек, НДС
            не облагается. <br/>
            1.3.2. За 6 календарных месяцев составляет 2394 рублей 00 копеек,
            НДС не облагается. За 3 календарных месяц доступа к боту в
            мессенджере Телеграм составляет 387 рублей 00 копеек, НДС не
            облагается. <br/>
            1.3.3. За 12 календарных месяцев составляет 3588 рублей 00 копеек,
            НДС не облагается. За 12 календарных месяц доступа к боту в
            мессенджере Телеграм составляет 1188 рублей 00 копеек, НДС не
            облагается.<br/>
            1.3.4. Оплата услуг осуществляется в порядке 100% (сто)-процентной
            предоплаты.<br/><br/> <b> 1.4. Тариф &quot;Доступ навсегда&quot;</b><br/><br/>
            1.4.1 Тариф &quot;Доступ навсегда&quot; является разовой покупкой доступа к
            Сервису с присвоением аккаунту клиента статуса PRO без ограничения
            срока действия и не является подпиской. <br/>1.4.2. Стоимость тарифа
            составляет 16 990 (шестнадцать тысяч девятьсот девяносто) рублей 00
            копеек, НДС не облагается.<br/> 1.4.3. Услуги по Тарифу
            предоставляются Исполнителем до момента прекращения
            существования юридического лица Исполнителя или до иного
            момента, установленного Исполнителем в связи с прекращением
            поддержки Сервиса в сети Интернет.<br/> 1.4.4. Пользователь может
            отказаться от использования Тарифа в течение 3 (трех) дней с
            момента покупки и обратиться к Исполнителю с требованием
            возврата денежных средств. После истечения указанного срока
            оплата по Тарифу является безвозвратной.
            <br/><br/><h3>2. Условия платежа и порядок расчетов.</h3><br/>
            2.1. Заказчик путем оформления Заявки на Сайте выбирает
            тип и период оказания Услуги и производит
            оплату.<br/><br/>
            2.2. В случае расторжения Договора по инициативе
            Заказчика (&quot;Отмены подписки&quot;) полученная предоплата по
            Договору за текущий и прошлые Календарные периоды не
            возвращается.<br/><br/>
            2.3. Исполнитель имеет право применять автоматическое
            списание оплаты стоимости Услуги с карты Заказчика за
            следующий календарный период, аналогичный выбранному
            заказчиком ранее, в случае пролонгации Договора,
            указанной в пункте 1.2.3.<br/><br/>
            2.4. Настоящий Договор может быть расторгнут в
            одностороннем порядке Исполнителем или Заказчиком в
            любое время
            <br/><br/><h3>3. Права и обязанности сторон</h3><br/> <b>3.1.
            Исполнитель обязуется:</b><br/><br/>
            3.1.1. Предоставлять Заказчику доступ к Сервису.<br/>
            3.1.2. Постоянно развивать и пополнять базы данных,
            стараясь держать информацию в актуальном
            состоянии. <br/>
            3.1.3. Отвечать на запросы и вопросы Заказчика,
            связанные с работой Сервиса, оплатой Услуг и
            выполнением Договора, направленные на адрес
            support@invest-idei.ru, в течение не более 5 (пяти)
            календарных дней.<br/>
            3.1.4. Предпринимать необходимые меры для защиты
            известных Исполнителю персональных данных
            Заказчика<br/>
            3.1.5. Обеспечивать техническую поддержку<br/><br/>
            <b>3.2. Заказчик обязуется:</b><br/><br/>
            3.2.1. Воздерживаться от модификации программы для
            ЭВМ (Сайта) и порождаемых ею результатов, в том
            числе от обхода технических средств защиты.<br/>
            3.2.2. Воздерживаться от использования возможных
            технических уязвимостей и ошибок в коде Сайта. В
            случае возникновения подозрений на ошибку Заказчик
            обязуется уведомить о них Исполнителя по электронной
            почте support@invest-idei.ru, после чего Исполнитель
            осуществит проверку указанной информации.<br/>
            3.2.3. Своевременно осуществлять оплату за
            предоставляемую Исполнителем услугу доступа к
            Сервису.<br/>3.2.4. Следить за дополнениями и
            изменениями в условиях Договора. В случае внесений
            изменений, указанных в п. 3.3.2, Заказчик должен
            самостоятельно принять решение о продолжении
            использования Сервиса и в случае необходимости
            удалить реквизиты своей банковской карты из Сервиса,
            если он не желает дальнейшего списания средств в
            соответствии с п. 3.3.4.<br/>3.2.5. При желании
            расторгнуть Договор и отменить его пролонгацию
            лично отказаться от дальнейшего использования
            Услуги в Личном кабинете на Сайте, выбрав
            команду &quot;Управление подпиской&quot; - &quot;Отменить
            подписку&quot;.<br/>3.2.6. Отправлять любые обращения,
            требования и уточнения, касающиеся
            использования Сервиса и оплаты услуг,
            исключительно на электронную почту,
            указанную в Реквизитах Магазина
            (support@invest-idei.ru). Сообщения,
            отправленные по другим каналам связи
            считаются недействительными и могут быть
            оставлены Исполнителем без ответа.<br/>3.2.7.
            Регулярно проверять электронные письма
            от Исполнителя, отправленные на
            указанный при регистрации адрес
            электронной почты. <br/><br/> <b>3.3
            Исполнитель имеет право:</b><br/><br/>
            3.3.1. Приостанавливать работу
            Сервиса для проведения технических
            работ<br/>
            3.3.2. В одностороннем порядке
            вносить дополнения и изменения в
            условия Договора. Если Заказчик
            продолжает использовать Сайт после
            вступления в силу дополнений или
            изменений, то считается, что он
            согласен со всеми дополнениями и
            (или) изменениями.<br/>
            3.3.3. Расторгать Договор с
            Заказчиком по своей инициативе. <br/>
            3.3.4. В одностороннем порядке
            списывать стоимость Услуг с
            банковской карты Заказчика перед
            началом очередного календарного
            периода предоставления доступа к
            Сервису<br/>3.3.5. Исполнитель имеет
            право отправлять информационные
            письма на адрес электронной почты,
            указанный пользователем при
            регистрации, в случае, если
            пользователь лично не отменил
            указанные подписки в Личном кабинете
            на Сайте. <br/><br/>
            4. Доступ к функционалу Сервиса,
            в том числе базам данных,
            принадлежащих Исполнителю,
            предоставляется исключительно
            для внутреннего использования
            Заказчиком, связанным с его
            личной деятельностью, не имеющей
            прямого отношения к обращению
            информации (продажа информации,
            оказание информационных услуг и
            т.п.). Заказчик обязуется не
            использовать полученную
            информацию в программных
            продуктах и базах данных,
            распространять ее среди третьих
            лиц.
            <br/><br/><h3>5. Ответственность
            сторон.</h3><br/>
            5.1. Стороны освобождаются
            от ответственности за
            частичное или полное
            неисполнение обязательств по
            настоящему Договору, если
            неисполнение обязательств
            являлось следствием
            обстоятельств непреодолимой
            силы (форс-мажор). Сторона,
            подвергшаяся воздействию
            обстоятельств непреодолимой
            силы, обязана в течение 3
            (трех) календарных дней
            уведомить об этом другую
            сторону.<br/><br/>
            5.2 Вся информация на Сайте
            носит исключительно
            образовательный и научный
            характер и не является
            рекомендацией или
            предложением к совершению
            сделок с финансовыми
            инструментами. Вы можете
            следовать или не следовать
            прогнозам на свой страх и
            риск. Компании и аналитики,
            прогнозы которых размещены
            на Сайте, являются
            независимыми от Исполнителя.
            Сайт является агрегатором
            информации, размещенной
            указанными лицами на
            интернет-ресурсах и в прочих
            источниках. Клиенты брокеров
            могут получать по подписке
            иные рекомендации, а также
            раньше или позже того, как
            они были опубликованы на
            Сайте. <br/><br/>
            5.3. Исполнитель не берет на
            себя обязательство
            корректировать аналитические
            данные и инвестиционные идеи
            в связи с утратой
            актуальности содержащейся в
            них информации, а также при
            выявлении несоответствия
            приводимых данных
            действительности.
            Исполнитель не несет
            ответственности за
            содержание и последствия
            использования размещенной
            информации, в том числе за
            любые возможные убытки от
            сделок с финансовыми
            инструментами.<br/><br/><h3>6.
            Заключительные
            положения.</h3><br/>
            6.1. Договор вступает в силу
            с момента начала оказания
            Услуг и действует в течение
            выбранного Заказчиком
            календарного
            периода. <br/><br/>
            6.2. Условия настоящего
            Договора полностью
            принимаются
            Заказчиком.<br/><br/>
            6.3. Все споры и разногласия
            решаются путем переговоров
            Сторон. <br/><br/><h1>Политика
            сайта Invest-idei.ru в
            отношении организации
            обработки и обеспечения
            безопасности персональных
            данных</h1><br/>Пользователь,
            регистрируясь на сайте
            https://invest-idei.ru
            (далее - Сайт), принимает
            настоящее Согласие на
            обработку персональных
            данных (далее – Согласие).
            Действуя свободно, своей
            волей и в своем интересе, а
            также подтверждая свою
            дееспособность, Пользователь
            дает свое согласие
            Администрации сайта, на
            обработку своих персональных
            данных со следующими
            условиями:<br/><br/>
            1. Данное Согласие
            дается на обработку
            персональных данных, как
            без использования
            средств автоматизации,
            так и с их
            использованием.<br/>
            2. Согласие дается на
            обработку следующих
            персональных данных:<br/>
            Имя, отчество, фамилия
            Пользователя; адрес
            электронной̆ почты;
            указанный Пользователем
            номер контактного
            телефона; адрес страницы
            пользователя в
            социальной сети
            Facebook.com или Vk.com,
            с использованием которой
            Пользователь принял
            решение авторизоваться
            на Сайте;
            пользовательские данные
            (сведения о
            местоположении; тип и
            версия ОС; тип и версия
            Браузера; тип устройства
            и разрешение его экрана;
            источник откуда пришел
            на сайт пользователь; с
            какого сайта или по
            какой рекламе; язык ОС и
            Браузера; какие страницы
            открывает и на какие
            кнопки нажимает
            пользователь; ip-адрес).<br/>
            3. Персональные данные
            не являются
            общедоступными.<br/>
            4. Цель обработки
            персональных данных:
            взаимодействие с
            Пользователем по
            исполнению
            Договора-оферты;
            проведение новостных
            рассылок; консультации
            по инвестиционным
            предложениям и услугам
            партнеров<br/>
            5. В ходе обработки с
            персональными данными
            будут совершены
            следующие действия:
            сбор; запись;
            систематизация;
            накопление; хранение;
            уточнение (обновление,
            изменение); извлечение;
            использование; передача
            (распространение,
            предоставление, доступ);
            блокирование; удаление;
            уничтожение.<br/>
            7. Обработка
            персональных данных
            может быть прекращена по
            запросу субъекта
            персональных данных.<br/>
            8. Согласие может быть
            отозвано субъектом
            персональных данных или
            его представителем путем
            направления письменного
            письменного требования в
            свободной форме на адрес
            ik@invest-idei.ru.<br/>
            9. В случае отзыва
            субъектом персональных
            данных или его
            представителем согласия
            на
            обработку персональных
            данных Администрация
            сайта вправе продолжить
            обработку персональных
            данных без согласия
            субъекта персональных
            данных при наличии
            оснований, указанных в
            Федеральном законе
            No152-ФЗ «О персональных
            данных»<br/>
            10. Настоящее согласие
            действует все время до
            момента прекращения
            обработки персональных
            данных на основаниях,
            указанных выше в данном
            Согласии.<br/>11. В
            случае если Пользователь
            не согласен с тем, что
            его персональные данные
            собираются и
            обрабатываются, он
            обязан немедленно
            покинуть Сайт. В
            противном случае это
            будет являться согласием
            на обработку его
            персональных данных.<br/><br/><br/>
            <h1>Правила конкурса
                &quot;Лига
                Инвест-Идей&quot;</h1>
            <br/>Пользователь,
            регистрируясь на
            сайте
            https://invest-idei.ru
            (далее - Сайт),
            принимает
            условия
            настоящих
            Правил. Действуя
            свободно, своей
            волей и в своем
            интересе, а
            также
            подтверждая свою
            дееспособность,
            Пользователь
            дает свое
            согласие на
            участие в
            Конкурсе со
            следующими
            условиями:<br/><br/>
            1. Конкурс
            проводится
            среди
            пользователей
            Сайта,
            оплативших
            доступ к
            сервису
            (подписка на
            Сервис, либо
            на
            Телеграмм-Бота
            (далее -
            Участники)<br/>
            2. Конкурс
            носит
            стимулирующий
            и
            образовательный
            характер для
            демонстрации
            Участникам
            возможностей
            Сервиса и
            стимулирования
            их
            активности
            на Сайте и в
            Телеграм-Боте<br/>
            3. Участник
            Конкурса
            имеет право
            на получения
            приза в
            случае, если
            он не
            выразил
            намерения
            расторгнуть
            Договор и
            согласен
            продлить
            действие
            Договора в
            месяце,
            следующим за
            месяцем
            подведения
            итогов
            Конкурса.<br/>
            4.
            Подробности
            об
            организаторе
            Конкурса, о
            правилах его
            проведения,
            количестве
            призов или
            выигрышей по
            результатам
            такого
            мероприятия,
            сроках,
            месте и
            порядке их
            получения и
            дополнения к
            ним
            публикуются
            на страницах
            https://invest-idei.ru/konkurs-liga-invest-idei
            и
            https://invest-idei.ru/terms<br/>
            5.
            Организатором
            Конкурса
            является
            Исполнитель
            по
            настоящему
            Договору<br/>
            6.
            Организатор
            Конкурса
            уплачивает
            за свой счет
            все налоги и
            сборы,
            необходимые
            по
            законодательству
            России, для
            выплаты
            призового
            вознаграждения.
            7. Участник
            обязан
            предоставить
            Организатору
            копию
            паспорта и
            ИНН для
            оформления
            приза и
            уплаты всех
            необходимых
            налогов и
            сборов
            Организатором
            8. Итоги
            Конкурса
            подводятся в
            день,
            указанный на
            странице
            https://invest-idei.ru/konkurs-liga-invest-idei
            . Для
            выявления
            победителей
            Организатор
            в
            автоматическом
            режиме
            определяет
            Участников,
            показавших
            наилучший
            результат в
            Итоговом
            рейтинге
            Участников. <br/>9.
            При
            подведении
            итогов
            Конкурса
            учитываются
            результаты
            по ставкам,
            сделанным
            участником в
            указанный
            период
            времени.
            Результаты
            ставок,
            сделанных до
            проведения
            конкурса,
            вычитаются
            из общего
            результата
            Участника<br/><br/><br/>
            <h1>Правила
                конкурса
                «Иностранцы
                в
                России»</h1>
            <br/>
            1.
            Целью
            Конкурса
            является
            Популяризация
            акций
            иностранных
            эмитентов,
            обращающихся
            на
            фондовом
            рынке
            Московской
            биржи,
            а
            также
            увеличение
            числа
            активных
            частных
            инвесторов.<br/><br/>
            2.
            Призовой
            фонд
            Конкурса
            составляет
            100
            000
            (сто
            тысяч
            тысяч)
            рублей.
            1
            место
            =
            50&nbsp;000
            рублей;
            2
            место
            =
            30&nbsp;000;
            бронза
            =
            20&nbsp;000
            рублей.
            <br/><br/>
            3.
            По
            итогам
            конкурса
            предусмотрены
            следующие
            номинации
            от
            Московской
            биржи,
            а
            также
            право
            на
            дополнительные.
            <br/><br/>
            -
            «Лучшее
            аналитическое
            покрытие
            иностранных
            акций» <br/>
            -
            «Лучшая
            инвестиционная
            идея
            по
            иностранным
            акциям» <br/><br/>
            4.
            Срок
            проведения
            Конкурса:
            с
            10:00
            по
            московскому
            времени
            07
            декабря
            2020
            года
            по
            23:50
            по
            московскому
            времени
            30
            июня
            2021
            года.<br/><br/>
            5.
            К
            участию
            в
            конкурсе
            допускаются
            физические
            и
            юридические
            лица,
            чьей
            основной
            деятельностью
            является
            деятельность
            на
            финансовом
            рынке.
            <br/><br/>
            6.
            Инструментами
            конкурса
            могут
            быть
            любые
            акции
            иностранных
            эмитентов,
            обращающихся
            на
            фондовом
            рынке
            Московской
            Биржи.
            Инвестиционные
            идеи
            должны
            быть
            реализуемы
            в
            торгах
            на
            Московской
            бирже
            (учитывается
            возможность
            операций
            шорт
            по
            отдельным
            бумагам).
            <br/><br/>
            7.
            Доходность
            рассчитывается
            в
            рублях.
            <br/><br/>
            8.
            Рейтинг
            участников
            рассчитывается
            и
            публикуется
            ежемесячно
            в
            первый
            рабочий
            день
            месяца
            на
            сайте
            www.invest-idei.ru
            <br/><br/>
            9.
            Победителями
            конкурса
            считаются
            участники,
            показавшие
            наибольшую
            положительную
            доходность
            и
            сгенерировавшие
            за
            время
            проведения
            конкурса
            не
            менее
            не
            менее
            5х
            инвестиционных
            идей
            за
            время
            проведения
            конкурса.
            <br/><br/>
            Доходность
            =
            Sum
            (Yi)/N<br/>
            где
            i=1,…,
            N<br/>
            N
            -
            количество
            идей
            участника,
            присланных
            на
            Конкурс<br/>
            Yi
            -
            финансовый
            результат
            (доходность)
            i-той
            инвестидеи,
            присланной
            на
            Конкурс. <br/>
            Yi
            =
            (Цена_текущая
            -
            Цена_старта)/Цена_старта
            *100%<br/>
            Цена_текущая,
            Цена_старта
            -
            соответствующие
            цена
            биржевых
            инструментов,
            являющихся
            базовым
            активом
            инвестидеи.<br/><br/>
            10.
            23
            июня
            2021
            –
            последний
            срок
            для
            регистрации
            инвестидей. <br/><br/>
            11.
            Для
            выявления
            победителей
            Организатор
            в
            автоматическом
            режиме
            определяет
            Участников,
            показавших
            наилучший
            результат
            в
            Итоговом
            рейтинге
            Участников
            в
            момент
            подведения
            итогов
            конкурса
            30
            июня
            2021.<br/><br/>
            12.
            Организатор
            Конкурса
            уплачивает
            за
            свой
            счет
            все
            налоги
            и
            сборы,
            необходимые
            по
            законодательству
            России,
            для
            выплаты
            призового
            вознаграждения.<br/><br/>
            13.
            В
            случае,
            если
            участников
            конкурса
            будет
            менее
            10,
            организатор
            вправе
            продлить
            проведения
            конкурса,
            но
            не
            более
            чем
            на
            3
            месяца.<br/><br/>
            14.
            Идеи
            будут
            идти
            в
            общей
            ленте
            с
            пометкой
            &quot;Участник
            конкурса
            &quot;Иностранцы
            в
            России&quot;.<br/><br/>
            15.
            Любые
            пользователи,
            в
            том
            числе
            без
            регистрации,
            смогут
            посмотреть
            идеи
            в
            рамках
            конкурса
            путем
            хронологического
            просмотра
            общей
            ленты.
            <br/><br/>
            16.
            Идеи
            по
            конкурсу
            должны
            транслироваться
            в
            Телеграмм-бот
            Инвест-идеи.
            <br/><br/>
        </div>
    )
}